content/lecture/introduction-to-environmental-science.md
+++
title = "Introduction to Environmental Science"
author = ["Soc Virnyl S. Estela"]
description = "and it's importance"
date = 2023-07-07
draft = true
[taxonomies]
+++

## <span class="org-todo todo TODO">TODO</span> To be posted {#to-be-posted}


## Definition {#definition}


## Components of an ecosystem {#components-of-an-ecosystem}


## Types of ecosystems {#types-of-ecosystems}


## Importance of ecosystems {#importance-of-ecosystems}


## Biodiversity {#biodiversity}


## Threats to the ecosystem {#threats-to-the-ecosystem}


## Review Questions {#review-questions}

1.  What is an ecosystem?
2.  What are examples of an ecosystem?
3.  What are its components? How do they interact with each other?
4.  Ecosystems are not static/stagnant. Why is this so?
5.  Why are ecosystems important?
6.  What is biodiversity? How is biodiversity related to ecosystems?
7.  How can biodiversity an indicator of a healthy ecosystem?
8.  What are threats to an ecosystem?
9.  What are invasive species? Why is an introduction of a species not native to its habitat can be a disaster?
10. Why is the circulation of nutrients in an ecosystem important?
